PHP Warning:  Constant DISALLOW_FILE_EDIT already defined in phar:///usr/local/bin/wp/vendor/wp-cli/wp-cli/php/WP_CLI/Runner.php(1334) : eval()'d code on line 8
{"ID":115,"post_author":"7","post_date":"2019-09-25 16:37:51","post_date_gmt":"2019-09-25 23:37:51","post_content":"<h1>About EHS Analytical Solutions, Inc.<\/h1>\t\t\t\t\n\t\t<p style=\"text-align: left;\">EHS Analytical Solutions, Inc. is a professional Environmental Health and Safety (EHS) consulting and Safety Staffing company serving businesses in San Diego County and throughout the United States. We are specialized in supporting: Biotech, Construction (Heavy Civil &amp; Energy Sectors), Pharmaceutical, Manufacturing, Industrial, and Aerospace companies. Our mission is to help our clients reduce their EHS operational costs, meet compliance objectives, reduce risk and liability, and achieve long-term efficiencies and solutions. <\/p><p style=\"text-align: left;\">EHS Analytical Solutions partners with our clients to provide the highest quality Environmental Health and Safety services and to provide the greatest value. We develop meaningful relationships, build trust, and provide our clients with solutions when navigating complex regulations and mitigating health and safety hazards. Our support allows our clients to concentrate on their primary business functions and technologies. Our specialized experts include Certified Industrial Hygienists (CIH), Certified Safety professionals (CSP), Certified Utility Safety professionals (CUSP), Construction Health Safety Technicians (CHST), Certified Asbestos Consultants (CAC), Safety Engineers, Air Quality Experts, Environmental Specialists, EM 385 Site Safety Health Officers (SSHO), Hazardous Waste Experts, and industry experts.<\/p><p>Certified Small Business and Disabled Veteran Business Enterprise (DVBE) # 2017031. Certified Service Disabled Veteran Owned Small Business (SDVOSB). EHS Analytical Solutions, Inc. is also registered with the State of California to work on Public Works projects, License # PW-LR-1000582275. <\/p>\t\t\n\t\t\t\t\t<h3>Adam Fillmore<\/h3>\t\t\t\t\n\t\t\t\t\t<h2>CIH, CSP, CAC, PMP<\/h2>\t\t\t\t\n\t\t\t\t\t<h4>Founder​<\/h4>\t\t\t\t\n<p>Adam is a recognized expert in industrial hygiene and safety and a leader in EHS management. He has saved clients millions of dollars from unwarranted claimed liability relating to loss claims. He has proven experience leading multiple teams of industrial hygiene and safety professionals globally and on large scale projects.<\/p>\n<p>Adam was a lead CIH consultant for BP's Incident Command during the Deepwater Horizon oil spill where he and his teams were responsible for evaluating industrial hygiene and safety for numerous operations spanning multiple states. During the California wildfires and hurricanes across the United States, he led high profile environmental loss investigations and was responsible for evaluating health, safety, and environmental hazards and providing expert remediation protocols.<\/p>\n<p>Adam has provided professional industrial hygiene and safety consulting services to Fortune 100 and 500 companies within multiple industries: insurance, manufacturing, aerospace, pharmaceutical, biotech, construction, power plant, waste management, and oil and gas.<\/p>\n<p>Adam acted as the Navy’s subject matter expert relating to health and safety for naval ship operations spanning all classes of warships. He developed Six Sigma projects to reduce the Navy’s largest disability expense. He is a Veteran having served in the United States Marine Corps.&nbsp;<\/p>\n<p>Adam has built and drove several research and development, biotechnology, and pharmaceutical companies’ EH&amp;S programs to achieve compliance and risk reduction.<\/p>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img width=\"250\" height=\"250\" src=\"https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2019\/10\/Adam-Fillmore-Web.jpg\" alt=\"Picture of Adam Fillmore who is nationally recognized as a safety, EHS and Industrial Hygiene expert who lives in San Diego and works for EHS Analytical Solutions, Inc. He is wearing a professional suit.\" srcset=\"https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2019\/10\/Adam-Fillmore-Web.jpg 250w, https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2019\/10\/Adam-Fillmore-Web-150x150.jpg 150w\" sizes=\"(max-width: 250px) 100vw, 250px\" \/>\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<h2><strong>Phone:<\/strong> 1-619-288-3094 <\/h2>\t\t\t\t\n\t\t\t\t\t<h2><a href=\"mailto:adam@ehsanalytical.com\"><strong>Email:<\/strong> adam@ehsanalytical.com<\/a><\/h2>\t\t\t\t\n\t\t<p>Please contact <a href=\"mailto:adam@ehsanalytical.com\">Adam Fillmore<\/a>, our Director of EHS Services, to schedule one of our services or to find out more.<\/p>\t\t\n\t\t\t\t\t<h3>Josh Porton<\/h3>\t\t\t\t\n\t\t\t\t\t<h2>MS, CIH, CSP<\/h2>\t\t\t\t\n\t\t\t\t\t<h4>Project Manager <br>\nSenior Industrial Hygiene and Safety Consultant\n<\/h4>\t\t\t\t\n\t\t<p>Josh Porton followed in his father’s footsteps and chose a career serving in the US Navy as an Industrial Hygiene Officer where he has spent the last 25 years learning and practicing industrial hygiene and occupational safety. He brings an enormous amount of knowledge and experience with him to EHS Analytical Solutions, Inc., in his role as a Senior Safety and Industrial Hygiene Consultant.<\/p><p>Josh has served in several disparate positions during his career in the US Navy including two nuclear aircraft carriers, four Naval hospitals, a preventive medicine unit, and the headquarters of the Pacific surface fleet. He has provided invaluable industrial hygiene and safety services in several capacities, as the sole provider to 3000 Sailors during his aircraft carrier tours to leading a team of industrial hygiene and safety professionals at the largest Naval shipyard on the west coast.<\/p><p>Josh is experienced with regulatory compliance inspections, audits, exposure assessment, engineering controls, radiation and biological safety, and scientific consultation. He is a proven EHS leader with track record of building and leading effective cross-functional and multi-site teams to drive safety culture changes and implement EHS strategies. He will help you build your safety program from the ground up.<\/p><p>Josh completed his Master of Science in Industrial Hygiene and Safety at the University of Washington in Seattle, but his heart remains in Pullman where he completed his undergraduate studies at Washington State University. GO COUGS!<\/p>\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img width=\"1080\" height=\"1080\" src=\"https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2025\/04\/josh_ehs.jpeg\" alt=\"\" srcset=\"https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2025\/04\/josh_ehs.jpeg 1080w, https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2025\/04\/josh_ehs-300x300.jpeg 300w, https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2025\/04\/josh_ehs-1024x1024.jpeg 1024w, https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2025\/04\/josh_ehs-150x150.jpeg 150w, https:\/\/eadn-wc03-5367322.nxedge.io\/wp-content\/uploads\/2025\/04\/josh_ehs-768x768.jpeg 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/>\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<h2><a href=\"mailto:josh@ehsanalytical.com\"><strong>Email:<\/strong> josh@ehsanalytical.com<\/a><\/h2>\t\t\t\t\n\t\t<p>Please contact <a href=\"mailto:josh@ehsanalytical.com\">Josh<\/a>, who is responsible for servicing clients in the Pacific Northwest, including the Portland, Oregon metro area, Seattle, and Vancouver, Washington, to schedule one of our services or to find out more.<\/p>\t\t\n\t\t\t<button data-settings=\"{&quot;duration&quot;:400}\" data-selector=\"#my-header\">\n\t\t\t\t\t<\/button>","post_title":"About Us","post_excerpt":"","post_status":"publish","comment_status":"closed","ping_status":"closed","post_password":"","post_name":"about-us","to_ping":"","pinged":"","post_modified":"2025-04-17 13:52:51","post_modified_gmt":"2025-04-17 20:52:51","post_content_filtered":"","post_parent":0,"guid":"https:\/\/ehsanalytical.com\/?page_id=115","menu_order":0,"post_type":"page","post_mime_type":"","comment_count":"0","url":"https:\/\/ehsanalytical.com\/about-us\/"}
